lib/xml/createAutodialCampaign.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:createAutodialCampaign>
            <!--Optional:-->
            <campaign>
                <!--Optional:-->
                <description>?</description>
                <!--Optional:-->
                <mode>?</mode>
                <!--Optional:-->
                <name>?</name>
                <!--Optional:-->
                <profileName>?</profileName>
                <!--Optional:-->
                <state>?</state>
                <!--Optional:-->
                <trainingMode>?</trainingMode>
                <!--Optional:-->
                <type>?</type>
                <!--Optional:-->
                <autoRecord>?</autoRecord>
                <!--Optional:-->
                <callWrapup>
                    <!--Optional:-->
                    <agentNotReady>?</agentNotReady>
                    <!--Optional:-->
                    <dispostionName>?</dispostionName>
                    <!--Optional:-->
                    <enabled>?</enabled>
                    <!--Optional:-->
                    <reasonCodeName>?</reasonCodeName>
                    <!--Optional:-->
                    <timeout>
                        <days>?</days>
                        <hours>?</hours>
                        <minutes>?</minutes>
                        <seconds>?</seconds>
                    </timeout>
                </callWrapup>
                <!--Optional:-->
                <ftpHost>?</ftpHost>
                <!--Optional:-->
                <ftpPassword>?</ftpPassword>
                <!--Optional:-->
                <ftpUser>?</ftpUser>
                <!--Optional:-->
                <recordingNameAsSid>?</recordingNameAsSid>
                <!--Optional:-->
                <useFtp>?</useFtp>
                <!--Optional:-->
                <analyzeLevel>?</analyzeLevel>
                <!--Optional:-->
                <CRMRedialTimeout>
                    <days>?</days>
                    <hours>?</hours>
                    <minutes>?</minutes>
                    <seconds>?</seconds>
                </CRMRedialTimeout>
                <!--Optional:-->
                <dnisAsAni>?</dnisAsAni>
                <!--Optional:-->
                <enableListDialingRatios>?</enableListDialingRatios>
                <!--Optional:-->
                <listDialingMode>?</listDialingMode>
                <!--Optional:-->
                <noOutOfNumbersAlert>?</noOutOfNumbersAlert>
                <!--Optional:-->
                <stateDialingRule>?</stateDialingRule>
                <!--Optional:-->
                <timeZoneAssignment>?</timeZoneAssignment>
                <!--Optional:-->
                <agentAvailability>?</agentAvailability>
                <!--Optional:-->
                <agentSkillName>?</agentSkillName>
                <!--Optional:-->
                <defaultIvrSchedule>
                    <!--Optional:-->
                    <name>?</name>
                    <!--Optional:-->
                    <scriptName>?</scriptName>
                    <!--Zero or more repetitions:-->
                    <scriptParameters>
                        <!--Optional:-->
                        <name>?</name>
                        <!--Optional:-->
                        <value>?</value>
                    </scriptParameters>
                </defaultIvrSchedule>
                <!--Optional:-->
                <dialIfAgentsAvailable>?</dialIfAgentsAvailable>
                <!--Optional:-->
                <maxNumOfLines>?</maxNumOfLines>
            </campaign>
        </ser:createAutodialCampaign>
    </soapenv:Body>
</soapenv:Envelope>